runs/snake3d/both_lips/2k35/RANS/system/profiles
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/graphs/sampleDict.cfg"

type sets;
libs ("libsampling.so");
writeControl timeStep;
writeInterval 10;

interpolationScheme cellPoint;

setFormat raw;

setConfig
{
    type lineUniform;
    axis y;
    nPoints 100;
}

sets
(
    line0
    {
        $setConfig;
        start (1.06 -3.0 0.0);
        end   (1.06  3.0 0.0);
    }
    line1
    {
        $setConfig;
        start (1.54 -3.0 0.0);
        end   (1.54  3.0 0.0);
    }
    line2
    {
        $setConfig;
        start (2.02 -3.0 0.0);
        end   (2.02  3.0 0.0);
    }
    line3
    {
        $setConfig;
        start (4.0 -3.0 0.0);
        end   (4.0  3.0 0.0);
    }
    line4
    {
        $setConfig;
        start (7.0 -3.0 0.0);
        end   (7.0  3.0 0.0);
    }
    line5
    {
        $setConfig;
        start (10.0 -3.0 0.0);
        end   (10.0  3.0 0.0);
    }
    centerline
    {
        type lineUniform;
        axis x;
        nPoints 500;
        start (0.0  0.0 0.0);
        end   (10.0 0.0 0.0);
    }

);

fields (U);

// ************************************************************************* //
